import os

# Render автоматически загружает Environment Variables
# load_dotenv() НЕ НУЖЕН в Render!

GIGACHAT_CLIENT_ID = os.getenv("GIGACHAT_CLIENT_ID")
BOT_TOKEN = os.getenv("BOT_TOKEN")
GIGACHAT_AUTH_KEY = os.getenv("GIGACHAT_AUTH_KEY")
YOUR_USER_ID = int(os.getenv("YOUR_USER_ID") or 0)  # Защита от None

# Остальное без изменений
COMPANIES = [
"ГУ ЯНАО МФЦ ИНН8901022910",
"ООО ЧЕРНОГОРСКАЯ ГРК ИНН7705721371",
"АО ХК Металлоинвест ИНН7705392230",
"ООО КНАУФ ГИПС ИНН5024051564",
"ПАО НЛМК	ИНН4823006703",
"АО ЛАБОРАТОРИЯ КАСПЕРСКОГО ИНН7713140469",
"АО ГРУППА СИНАРА ИНН6658252583",
"ПАО НПК ОВК ИНН705522866",
"ООО Карморнефтегаз ИНН9909390322",
"ПАО СОВКОМБАНК ИНН4401116480",
"ООО РУСГАЗШЕЛЬФ ИНН7719472189",
"ОАО УРАЛЬСКАЯ ГОРНО-МЕТАЛЛУРГИЧЕСКАЯ КОМПАНИЯ ИНН6606013640",
"АО ОМК ИНН7736030085",
"АО ПОЛИМЕТАЛЛ ИНН7805104870",
"АО БАЗ ИНН258001489",
"ПАО ХИМПРОМ ИНН2124009521",
"ООО УРАЛЬСКИЕ ЛОКОМОТИВЫ ИНН6606033929",
"ООО ТОМСК-ЭНЕРДЖИ ИНН7014057472",
"АО ОМПК ИНН7715034360",
"ЗАО МИКОЯНОВСКИЙ МЯСОКОМБИНАТ ИНН7722169626",
"ПАО ЯКОВЛЕВ ИНН3807002509",
"АО СЛПК ИНН1121003135",
"ООО АВТОЗАВОД АГР ИНН7801463902",
"ООО СОКАР РУС ИНН7707803527",
"АО УГОЛЬ-ТРАНС ИНН5047210316",
"АО ЕПК ИНН7722242530",
"АО ОБНИНСКОРГСИНТЕЗ ИНН4025415519",
"ООО КООРДИАНТ ИНН3454000582",
"ООО ПК ИМЗ ИНН6611008420",
"АО АКРОН ХОЛДИНГ ИНН6324023665",
"АО БАНК СИНАРА ИНН6608003052",
"АО КОНАР ИНН7451064592",
"АО ГРУППА САФМАР ИНН7713622487",
"АО ИТ-ЭЛЕМЕНТ29 ИНН6686168100",
"АО ПФ СКБ КОНТУР ИНН6663003127",
"АО СТМ ИНН6672241304",
"ООО ОНЛАНТА ИНН7722653629",
"ООО ХКА ИНН6658388288",
"ООО ГАЗПРОМ НЕДРА ИНН7709769582",
"ТФОМС АЛТАЙСКОГО КРАЯ ИНН2221002257",

]

IT_VENDORS = [
    "Cisco", "HPE", "Dell", "Lenovo", "IBM", "Oracle", 
    "Microsoft", "VMware", "Huawei", "Fortinet", "Brocade",
    "Kaspersky", "DrWeb", "1C", "Bitrix24", "BPMSoft"
]

IT_KEYWORDS = [
    "техническая поддержка", "сервисная поддержка", 
    "поставка оборудования", "сервер", "сетевое оборудование",
    "ИТ услуги", "информационная безопасность", "СЗИ",
    "лицензии", "ПО", "software", "облако", "облачные услуги"
]

SITES = [
    "https://rostender.info/search",
    "https://b2b-center.ru/tenders", 
    "https://bidzaar.com/ru/tenders",
    "https://www.rts-tender.ru/search",
    "https://etp.metal-it.ru/torgs",
    "https://zakupki.tmk-group.com/tenders"
]
